package org.example.InputOutput;

// 문제: A와 B는 터렛에 근무하는 직원이다. C는 A와B에게 D의 위치를 계산하라는 명령을 내렸다.
// A와 B는 각자 샂신의 위치에서 현재 적까지의 거리를 계산했다.
// A의 좌표(x1,y1)와 B의 좌표(x2,y2)가 주어지고, A가 계산한 D와의 거리 r1과 B가 계산한 D와의 거리 r2가
// 주어졌을때 D가 있을 수 있는 좌표의 수를 출력하는 프로그램을 작성하시오.

// 입력: 첫째줄에 테스트 케이스의 개수 T가 주어진다. 각 테스트 케이스는 다음과 같이 이루어져 있다.
// 한줄에 x1,y1,r1,x2,y2,r2가 주어진다. x1,y1,x2,y2 -10000보다 크거나 같고, 10000보다 작거나 같은 정수이고
// r1,r2는 10000보다 작거나 같은 음이 아닌 정수이다.

//출력: 각 테스트 케이스마다 D가 있을 수 있는 위치의 수를 출력한다. D가 있을 수 있는 위치의 개수가
// 무한대일 경우에는 -1을 출력한다.
public class baekjonn_1002 {
    public static void main(String[] args){

    }
}
